/**
 »метс€ ресторан, в котором сто€т столики.  лиент заказывает суп, торт и кофе.
 ¬ ресторане есть з повара, каждый из которых умеет готовить одно из блюд. ( ѕовара - производители. )
  лиенты могут забирать из очереди в произвольном пор€дке, но употребл€ть должны
 строго последовательно - сначала суп, потом торт, потом кофе. ѕовара могу готовить впрок, но не более 5ти блюд.
 –еализовать модель ресторана, использу€ паттерн producer-consumer. ћинимизировать количество простоев клиентов.
 */

public class Threads_3 {

    public static void main(String[] args) {

    }

}

class Consumer{

}

class ChefCook{

}

class Tea{

}

class Soup{

}

class Cake{

}